W4D5/music_app/app/controllers/albums_controller.rb

  def create
    album = Album.new(album_params)

    switch_record(album)

    if album.save
---
INSERT INTO "albums" ("band_id", "title", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["band_id", 1], ["title", "The bat"], ["date", "2018-06-01"], ["created_at", "2018-06-14 19:26:39.155012"], ["updated_at", "2018-06-14 19:26:39.155012"]]

  def update
    album = Album.find(params[:id])
    # byebug
    switch_record(album)
    # byebug
    if album.update_attributes(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "title" = $1, "band_id" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["title", "The fasfsa"], ["band_id", 2], ["updated_at", "2018-06-14 19:53:18.941764"], ["id", 1]]

  def destroy
    album = Album.find(params[:id])
    album.destroy!
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 2]]