music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "The Baseballs"], ["created_at", "2018-06-14 17:46:56.139485"], ["updated_at", "2018-06-14 17:46:56.139485"]]
---
  def create
    band = Band.new(name: band_params[:name])

    if band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "DUrka MAn"], ["updated_at", "2018-06-14 18:10:11.627079"], ["id", 3]]
---
  def update
    # byebug
    band = Band.find(params[:id])

    if band.update_attributes(band_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 3]]
---
  def destroy
    band = Band.find(params[:id])
    band.destroy!