W4D5/music_app/app/views/albums/_form.html.erb

    <% end %>
    <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"