music_app/app/views/bands/index.html.erb


<% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"