W4D5/music_app/app/views/users/index.html.erb

SELECT "users".* FROM "users"
---

<% User.all.each do |user| %>